rafaelmartins/usbd-fs-stm32/src/usbd.c
/*
 * usbd-fs-stm32: A lightweight (and very opinionated) USB FS device stack for STM32.
 *
 * SPDX-FileCopyrightText: 2024-2025 Rafael G. Martins <rafael@rafaelmartins.eng.br>
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <stdbool.h>
#include <stdlib.h>

#include <usbd.h>

#if defined(STM32C0) || defined(STM32C0xx)
#include <stm32c0xx.h>
#define USB_PMA_SIZE 2048
#define USB_PMA_TYPE uint32_t
#elif defined(STM32F0) || defined(STM32F0xx)
#include <stm32f0xx.h>
#define USB_PMA_SIZE 1024
#define USB_PMA_TYPE uint16_t
#elif defined(STM32G0) || defined(STM32G0xx)
#include <stm32g0xx.h>
#define USB_PMA_SIZE 2048
#define USB_PMA_TYPE uint32_t
#elif defined(STM32G4) || defined(STM32G4xx)
#include <stm32g4xx.h>
#define USB_PMA_SIZE 1024
#define USB_PMA_TYPE uint16_t
#else
#error "Unsupported STM32 series"
#endif

#ifndef USB
#ifdef USB_DRD_FS
#define USB USB_DRD_FS
#define USB_PMAADDR USB_DRD_PMAADDR
#define EP0R CHEP0R
#define EP1R CHEP1R
#define EP2R CHEP2R
#define EP3R CHEP3R
#define EP4R CHEP4R
#define EP5R CHEP5R
#define EP6R CHEP6R
#define EP7R CHEP7R
#define USB_EPRX_STAT USB_EP_RX_STRX
#define USB_EPTX_STAT USB_EP_TX_STTX
#define USB_EP_CTR_RX USB_CHEP_VTRX
#define USB_EP_CTR_TX USB_CHEP_VTTX
#define USB_EPADDR_FIELD USB_CHEP_ADDR
#define USB_EPREG_MASK USB_CHEP_REG_MASK
#define USB_CNTR_FSUSP USB_CNTR_SUSPEN
#define USB_ISTR_EP_ID USB_ISTR_IDN
#else
#error "No supported USB device available"
#endif
#endif

#ifndef USB_COUNT0_RX_BLSIZE
#define USB_COUNT0_RX_BLSIZE        (0x1UL << (15U))
#define USB_COUNT0_RX_NUM_BLOCK_Pos (10U)
#define USB_COUNT1_RX_0_COUNT1_RX_0 (0x000003FFU)
#endif

#ifndef USBD_EP1_IN_SIZE
#define USBD_EP1_IN_SIZE 0
#endif
#ifndef USBD_EP1_OUT_SIZE
#define USBD_EP1_OUT_SIZE 0
#endif
#ifndef USBD_EP2_IN_SIZE
#define USBD_EP2_IN_SIZE 0
#endif
#ifndef USBD_EP2_OUT_SIZE
#define USBD_EP2_OUT_SIZE 0
#endif
#ifndef USBD_EP3_IN_SIZE
#define USBD_EP3_IN_SIZE 0
#endif
#ifndef USBD_EP3_OUT_SIZE
#define USBD_EP3_OUT_SIZE 0
#endif
#ifndef USBD_EP4_IN_SIZE
#define USBD_EP4_IN_SIZE 0
#endif
#ifndef USBD_EP4_OUT_SIZE
#define USBD_EP4_OUT_SIZE 0
#endif
#ifndef USBD_EP5_IN_SIZE
#define USBD_EP5_IN_SIZE 0
#endif
#ifndef USBD_EP5_OUT_SIZE
#define USBD_EP5_OUT_SIZE 0
#endif
#ifndef USBD_EP6_IN_SIZE
#define USBD_EP6_IN_SIZE 0
#endif
#ifndef USBD_EP6_OUT_SIZE
#define USBD_EP6_OUT_SIZE 0
#endif
#ifndef USBD_EP7_IN_SIZE
#define USBD_EP7_IN_SIZE 0
#endif
#ifndef USBD_EP7_OUT_SIZE
#define USBD_EP7_OUT_SIZE 0
#endif

#ifndef USBD_EP1_TYPE
#define USBD_EP1_TYPE BULK
#endif
#ifndef USBD_EP2_TYPE
#define USBD_EP2_TYPE BULK
#endif
#ifndef USBD_EP3_TYPE
#define USBD_EP3_TYPE BULK
#endif
#ifndef USBD_EP4_TYPE
#define USBD_EP4_TYPE BULK
#endif
#ifndef USBD_EP5_TYPE
#define USBD_EP5_TYPE BULK
#endif
#ifndef USBD_EP6_TYPE
#define USBD_EP6_TYPE BULK
#endif
#ifndef USBD_EP7_TYPE
#define USBD_EP7_TYPE BULK
#endif

#if (USBD_EP1_IN_SIZE + USBD_EP1_OUT_SIZE + USBD_EP2_IN_SIZE + USBD_EP2_OUT_SIZE + \
     USBD_EP3_IN_SIZE + USBD_EP3_OUT_SIZE + USBD_EP4_IN_SIZE + USBD_EP4_OUT_SIZE + \
     USBD_EP5_IN_SIZE + USBD_EP5_OUT_SIZE + USBD_EP6_IN_SIZE + USBD_EP6_OUT_SIZE + \
     USBD_EP7_IN_SIZE + USBD_EP7_OUT_SIZE) > (USB_PMA_SIZE - 64 - USBD_EP0_SIZE - USBD_EP0_SIZE)
#error "Unsupported endpoint configuration, not enough USB SRAM available"
#endif

typedef __PACKED_STRUCT {
    uint16_t addr;
    uint16_t cnt;
} pma_entry_t;

static struct {
    uint16_t type;
    __IOM uint16_t* reg;
    uint32_t pma_in;
    uint32_t pma_out;
    uint8_t size_in;
    uint8_t size_out;
} endpoints[] = {
    {
        .type     = USB_EP_CONTROL,
        .reg      = (__IOM uint16_t*) &(USB->EP0R),
        .pma_in   = USB_PMAADDR,
        .pma_out  = USB_PMAADDR + sizeof(pma_entry_t),
        .size_in  = USBD_EP0_SIZE,
        .size_out = USBD_EP0_SIZE,
    },

#define __endpoint(EPT, TYP)                                        \
    {                                                               \
        .type     = USB_EP_ ## TYP,                                 \
        .reg      = (__IOM uint16_t*) &(USB->EP ## EPT ## R),       \
        .pma_in   = USB_PMAADDR + (EPT << 3),                       \
        .pma_out  = USB_PMAADDR + (EPT << 3) + sizeof(pma_entry_t), \
        .size_in  = USBD_EP ## EPT ## _IN_SIZE,                     \
        .size_out = USBD_EP ## EPT ## _OUT_SIZE,                    \
    }
#define _endpoint(EPT, TYP) __endpoint(EPT, TYP)
#define endpoint(EPT)       _endpoint(EPT, USBD_EP ## EPT ## _TYPE)

    endpoint(1),
    endpoint(2),
    endpoint(3),
    endpoint(4),
    endpoint(5),
    endpoint(6),
    endpoint(7),

#undef endpoint
#undef _endpoint
#undef __endpoint
};


static void
pma_read(uint32_t addr, void *buf, uint16_t len)
{
    __IO USB_PMA_TYPE *src = (USB_PMA_TYPE*) addr;
    USB_PMA_TYPE *dst = (USB_PMA_TYPE*) buf;

    uint16_t ch = len / sizeof(USB_PMA_TYPE);
    for (uint16_t c = 0; c < ch; c++)
        *(dst++) = *(src++);

    uint8_t r = len % sizeof(USB_PMA_TYPE);
    if (r == 0)
        return;

    uint8_t *dstb = (uint8_t*) dst;
    for (uint8_t b = 0; b < r; b++)
        *(dstb++) = *(src++);
}

static void
pma_write(uint32_t addr, const void *buf, uint16_t len)
{
    const USB_PMA_TYPE *src = (const USB_PMA_TYPE*) buf;
    __IO USB_PMA_TYPE *dst = (USB_PMA_TYPE*) addr;

    uint16_t ch = len / sizeof(USB_PMA_TYPE);
    for (uint16_t c = 0; c < ch; c++)
        *(dst++) = *(src++);

    uint8_t r = len % sizeof(USB_PMA_TYPE);
    if (r == 0)
        return;

    uint8_t *srcb = (uint8_t*) src;
    USB_PMA_TYPE dstv = 0;
    uint8_t *dstb = (uint8_t*) &dstv;
    for (uint8_t b = 0; b < r; b++)
        *(dstb++) = *(srcb++);
    *dst = dstv;
}

static void
pma_init(void)
{
    uint32_t entry_addr = USB_PMAADDR;
    uint32_t mem_addr = 16 * sizeof(pma_entry_t);  // right after entry table

    for (uint8_t i = 0; i < 8; i++) {
        pma_entry_t e = {
            .addr = mem_addr,
            .cnt = 0,
        };
        pma_write(entry_addr, &e, sizeof(pma_entry_t));

        entry_addr += sizeof(pma_entry_t);
        mem_addr += endpoints[i].size_in;

