rafaelmartins/usbd-fs-stm32/src/usbd.c
        e.addr = mem_addr;
        if (endpoints[i].size_out > 62)
            e.cnt = USB_COUNT0_RX_BLSIZE | (((endpoints[i].size_out >> 6) & 0b11111) << USB_COUNT0_RX_NUM_BLOCK_Pos);
        else
            e.cnt = ((endpoints[i].size_out >> 1) & 0b11111) << USB_COUNT0_RX_NUM_BLOCK_Pos;
        pma_write(entry_addr, &e, sizeof(pma_entry_t));

        entry_addr += sizeof(pma_entry_t);
        mem_addr += endpoints[i].size_out;
    }

#ifdef USB_BTABLE
    USB->BTABLE = 0;
#endif
}


bool
usbd_in(uint8_t ept, const void *buf, uint16_t buflen)
{
    if (ept >= 8 || (((*endpoints[ept].reg) & (USB_EPTX_STAT | USB_EPADDR_FIELD)) != (USB_EP_TX_NAK | ept)))
        return false;

    pma_entry_t e;
    pma_read(endpoints[ept].pma_in, &e, sizeof(pma_entry_t));

    if (e.addr == 0)
        return false;

    e.cnt = buflen;

    pma_write(USB_PMAADDR + e.addr, buf, buflen);
    pma_write(endpoints[ept].pma_in, &e, sizeof(pma_entry_t));

    __IO uint16_t *ep = endpoints[ept].reg;
    *ep = (*ep ^ USB_EP_TX_VALID) & (USB_EPREG_MASK | USB_EPTX_STAT);
    return true;
}

uint16_t
usbd_out(uint8_t ept, void *buf, uint16_t buflen, bool autoenable)
{
    if (ept >= 8)
        return false;

    pma_entry_t e;
    pma_read(endpoints[ept].pma_out, &e, sizeof(pma_entry_t));

    if (e.addr == 0)
        return false;

    uint16_t rv = e.cnt & USB_COUNT1_RX_0_COUNT1_RX_0;
    rv = (rv > buflen) ? buflen : rv;

    pma_read(USB_PMAADDR + e.addr, buf, buflen);

    if (autoenable)
        usbd_out_enable(ept);

    return rv;
}

void
usbd_out_enable(uint8_t ept)
{
    __IO uint16_t *ep = endpoints[ept].reg;
    *ep = (*ep ^ USB_EP_RX_VALID) & (USB_EPREG_MASK | USB_EPRX_STAT);
}


static const uint8_t* ctrl_in_buf = NULL;
static uint16_t ctrl_in_buflen = 0;

void
usbd_control_in(const void *buf, uint16_t buflen, uint16_t reqlen)
{
    uint16_t total = reqlen < buflen ? reqlen : buflen;
    uint16_t l = total > USBD_EP0_SIZE ? USBD_EP0_SIZE : total;
    usbd_in(0, (uint8_t*) buf, l);
    ctrl_in_buf = total > USBD_EP0_SIZE ? buf + USBD_EP0_SIZE : NULL;
    ctrl_in_buflen = total > USBD_EP0_SIZE ? total - USBD_EP0_SIZE : 0;
}

static bool
usbd_control_in_resume(void)
{
    if (ctrl_in_buf == NULL)
        return false;

    uint16_t l = ctrl_in_buflen > USBD_EP0_SIZE ? USBD_EP0_SIZE : ctrl_in_buflen;
    usbd_in(0, ctrl_in_buf, l);
    ctrl_in_buf = ctrl_in_buflen > USBD_EP0_SIZE ? ctrl_in_buf + USBD_EP0_SIZE : NULL;
    ctrl_in_buflen = ctrl_in_buflen > USBD_EP0_SIZE ? ctrl_in_buflen - USBD_EP0_SIZE : 0;
    return true;
}


__STATIC_FORCEINLINE uint8_t
get_config_bConfigurationValue(void)
{
    const usb_config_descriptor_t *cfg = usbd_get_config_descriptor_cb();
    if (cfg == NULL)
        return 0;
    return cfg->bConfigurationValue;
}

__STATIC_FORCEINLINE bool
write_device_descriptor(usb_ctrl_request_t *req)
{
    const usb_device_descriptor_t *dev = usbd_get_device_descriptor_cb();
    if (dev == NULL)
        return false;

    usbd_control_in(dev, dev->bLength, req->wLength);
    return true;
}

__STATIC_FORCEINLINE bool
write_config_descriptor(usb_ctrl_request_t *req)
{
    const usb_config_descriptor_t *cfg = usbd_get_config_descriptor_cb();
    if (cfg == NULL)
        return false;

    usbd_control_in(cfg, cfg->wTotalLength, req->wLength);
    return true;
}

__STATIC_FORCEINLINE bool
write_string_descriptor(usb_ctrl_request_t *req)
{
    const usb_string_descriptor_t *str = usbd_get_string_descriptor_cb(req->wIndex, req->wValue);
    if (str == NULL)
        return false;

    usbd_control_in(str, str->bLength, req->wLength);
    return true;
}


static enum {
    STATE_DEFAULT,
    STATE_ADDRESS,
    STATE_CONFIGURED,
} state = STATE_DEFAULT;

static bool set_address = false;
static uint16_t address = 0;

static bool
handle_ctrl_setup(usb_ctrl_request_t *req)
{
    if ((req->bmRequestType & USB_REQ_TYPE_MASK) == USB_REQ_TYPE_CLASS) {
        if (usbd_ctrl_request_handle_class_cb)
            return usbd_ctrl_request_handle_class_cb(req);
        return false;
    }

    if ((req->bmRequestType & USB_REQ_TYPE_MASK) == USB_REQ_TYPE_VENDOR) {
        if (usbd_ctrl_request_handle_vendor_cb)
            return usbd_ctrl_request_handle_vendor_cb(req);
        return false;
    }

    switch (req->bRequest) {
    case USB_REQ_GET_STATUS:
        if (((req->bmRequestType & USB_REQ_DIR_MASK) == USB_REQ_DIR_HOST_TO_DEVICE) ||
            (state != STATE_CONFIGURED))
            break;

        uint8_t status[2] = {0, 0};

        switch (req->bmRequestType & USB_REQ_RCPT_MASK) {
        case USB_REQ_RCPT_DEVICE:
            {
                const usb_config_descriptor_t *cfg = usbd_get_config_descriptor_cb();
                if (cfg != NULL && (cfg->bmAttributes & USB_DESCR_CONFIG_ATTR_SELF_POWERED))
                    status[0] |= (1 << 0);
            }
            break;

        case USB_REQ_RCPT_INTERFACE:
            if (usbd_get_interface_descriptor_cb(req->wIndex) == NULL)
                return false;
            break;

        case USB_REQ_RCPT_ENDPOINT:
            {
                uint8_t ept = req->wIndex & 0x7;
                if (req->wIndex & USB_DESCR_EPT_ADDR_DIR_IN) {
                    if (endpoints[ept].size_in == 0)
                        return false;
                    if ((*(endpoints[ept].reg) & USB_EPTX_STAT) == USB_EP_TX_STALL)
                        status[0] |= (1 << 0);
                }
                else {
                    if (endpoints[ept].size_out == 0)
                        return false;
                    if ((*(endpoints[ept].reg) & USB_EPRX_STAT) == USB_EP_RX_STALL)
                        status[0] |= (1 << 0);
                }
            }
            break;
        }

        usbd_control_in(status, sizeof(status), req->wLength);
        return true;

    case USB_REQ_CLEAR_FEATURE:
        {
            if (((req->bmRequestType & USB_REQ_DIR_MASK) == USB_REQ_DIR_DEVICE_TO_HOST) ||
                ((req->bmRequestType & USB_REQ_RCPT_MASK) != USB_REQ_RCPT_ENDPOINT) ||
                (req->wValue != USB_DESCR_FEAT_ENDPOINT_HALT) ||
                (state != STATE_CONFIGURED))
                break;

            uint8_t ept = req->wIndex & 0x7;
            if ((endpoints[ept].type != USB_EP_BULK) && (endpoints[ept].type != USB_EP_INTERRUPT))
                break;

            if (req->wIndex & USB_DESCR_EPT_ADDR_DIR_IN) {
                if (endpoints[ept].size_in != 0) {
                    *(endpoints[ept].reg) = (*(endpoints[ept].reg) ^ USB_EP_TX_NAK) &
                        (USB_EPREG_MASK | USB_EPTX_STAT | USB_EP_DTOG_TX);
                    return true;
                }
            }
            else if (endpoints[ept].size_out != 0) {
                *(endpoints[ept].reg) = (*(endpoints[ept].reg) ^ USB_EP_RX_VALID) &
                    (USB_EPREG_MASK | USB_EPRX_STAT | USB_EP_DTOG_RX);
                return true;
            }
        }
        break;

