rafaelmartins/usbd-fs-stm32/src/usbd.c
    case USB_REQ_SET_FEATURE:
        {
            if (((req->bmRequestType & USB_REQ_DIR_MASK) == USB_REQ_DIR_DEVICE_TO_HOST) ||
                ((req->bmRequestType & USB_REQ_RCPT_MASK) != USB_REQ_RCPT_ENDPOINT) ||
                (req->wValue != USB_DESCR_FEAT_ENDPOINT_HALT) ||
                (state != STATE_CONFIGURED))
                break;

            uint8_t ept = req->wIndex & 0x7;
            if ((endpoints[ept].type != USB_EP_BULK) && (endpoints[ept].type != USB_EP_INTERRUPT))
                break;

            if (req->wIndex & USB_DESCR_EPT_ADDR_DIR_IN) {
                if (endpoints[ept].size_in != 0) {
                    *(endpoints[ept].reg) = (*(endpoints[ept].reg) ^ USB_EP_TX_STALL) &
                        (USB_EPREG_MASK | USB_EPTX_STAT);
                    return true;
                }
            }
            else if (endpoints[ept].size_out != 0) {
                *(endpoints[ept].reg) = (*(endpoints[ept].reg) ^ USB_EP_RX_STALL) &
                    (USB_EPREG_MASK | USB_EPRX_STAT);
                return true;
            }
        }
        break;

    case USB_REQ_SET_ADDRESS:
        if (((req->bmRequestType & USB_REQ_DIR_MASK) == USB_REQ_DIR_DEVICE_TO_HOST) ||
            ((req->bmRequestType & USB_REQ_RCPT_MASK) != USB_REQ_RCPT_DEVICE))
            break;

        switch (state) {
        case STATE_DEFAULT:
            if (req->wValue == 0)
                break;
            // fall through

        case STATE_ADDRESS:
            address = (req->wValue & USB_DADDR_ADD);
            set_address = true;
            if (usbd_set_address_hook_cb)
                usbd_set_address_hook_cb(address);
            break;

        case STATE_CONFIGURED:
            break;
        }

        return true;

    case USB_REQ_GET_DESCRIPTOR:
        if ((req->bmRequestType & USB_REQ_DIR_MASK) == USB_REQ_DIR_HOST_TO_DEVICE)
            break;

        switch (req->bmRequestType & USB_REQ_RCPT_MASK) {
        case USB_REQ_RCPT_DEVICE:
            switch (req->wValue >> 8) {
            case USB_DESCR_TYPE_DEVICE:
                return write_device_descriptor(req);

            case USB_DESCR_TYPE_CONFIGURATION:
                return write_config_descriptor(req);

            case USB_DESCR_TYPE_STRING:
                return write_string_descriptor(req);
            }
            break;

        case USB_REQ_RCPT_INTERFACE:
            if (usbd_ctrl_request_get_descriptor_interface_cb)
                return usbd_ctrl_request_get_descriptor_interface_cb(req);
            break;
        }
        break;

    case USB_REQ_SET_DESCRIPTOR:
        // not supported
        break;

    case USB_REQ_GET_CONFIGURATION:
        if (((req->bmRequestType & USB_REQ_DIR_MASK) == USB_REQ_DIR_HOST_TO_DEVICE) ||
            ((req->bmRequestType & USB_REQ_RCPT_MASK) != USB_REQ_RCPT_DEVICE))
            break;

        uint8_t config = state == STATE_CONFIGURED ? get_config_bConfigurationValue() : 0;
        usbd_control_in(&config, sizeof(config), req->wLength);
        return true;

    case USB_REQ_SET_CONFIGURATION:
        if (((req->bmRequestType & USB_REQ_DIR_MASK) == USB_REQ_DIR_DEVICE_TO_HOST) ||
            ((req->bmRequestType & USB_REQ_RCPT_MASK) != USB_REQ_RCPT_DEVICE) ||
            (state == STATE_DEFAULT))
            break;

        if (req->wValue == 0) {
            state = STATE_ADDRESS;
            for (uint8_t i = 1; i < 8; i++)
                *(endpoints[i].reg) &= ~USB_EPREG_MASK;
        }
        else if (((uint8_t) req->wValue) == get_config_bConfigurationValue()) {
            state = STATE_CONFIGURED;

            for (uint8_t i = 1; i < 8; i++) {
                if (endpoints[i].size_in == 0 && endpoints[i].size_out == 0)
                    continue;

                __IO uint16_t *ep = endpoints[i].reg;
                *ep &= ~USB_EPREG_MASK;
                *ep |= endpoints[i].type | i;

                if (endpoints[i].size_in != 0)
                    *ep = (*ep ^ USB_EP_TX_NAK) &
                        (USB_EPREG_MASK | USB_EPTX_STAT | USB_EP_DTOG_TX);
                if (endpoints[i].size_out != 0)
                    *ep = (*ep ^ USB_EP_RX_VALID) &
                        (USB_EPREG_MASK | USB_EPRX_STAT | USB_EP_DTOG_RX);
            }
        }
        else
            break;

        return true;

    case USB_REQ_GET_INTERFACE:
        {
            if (((req->bmRequestType & USB_REQ_DIR_MASK) == USB_REQ_DIR_HOST_TO_DEVICE) ||
                ((req->bmRequestType & USB_REQ_RCPT_MASK) != USB_REQ_RCPT_INTERFACE) ||
                (state != STATE_CONFIGURED))
                break;

            const usb_interface_descriptor_t *itf = usbd_get_interface_descriptor_cb(req->wIndex);
            if (itf == NULL)
                break;

            usbd_control_in(&(itf->bAlternateSetting), sizeof(itf->bAlternateSetting), req->wLength);
            return true;
        }
        break;

    case USB_REQ_SET_INTERFACE:
        {
            if (((req->bmRequestType & USB_REQ_DIR_MASK) == USB_REQ_DIR_DEVICE_TO_HOST) ||
                ((req->bmRequestType & USB_REQ_RCPT_MASK) != USB_REQ_RCPT_INTERFACE) ||
                (state != STATE_CONFIGURED))
                break;

            // no alternate setting supported, but someone may still try to re-set
            const usb_interface_descriptor_t *itf = usbd_get_interface_descriptor_cb(req->wIndex);
            if (itf == NULL)
                break;

            if (itf->bAlternateSetting == (uint8_t) req->wValue)
                return true;
        }
        break;

    case USB_REQ_SYNCH_FRAME:
        // isochronous endpoints not supported
        break;
    }

    return false;
}


void
usbd_init(void)
{
#if defined(STM32C0) || defined(STM32C0xx)
    RCC->APBENR1 |= RCC_APBENR1_USBEN;
    RCC->APBRSTR1 |= RCC_APBRSTR1_USBRST;
    RCC->APBRSTR1 &= ~RCC_APBRSTR1_USBRST;
#endif

#if defined(STM32F0) || defined(STM32F0xx)
    RCC->APB1ENR |= RCC_APB1ENR_USBEN;
    RCC->APB1RSTR |= RCC_APB1RSTR_USBRST;
    RCC->APB1RSTR &= ~RCC_APB1RSTR_USBRST;
#endif

#if defined(STM32G0) || defined(STM32G0xx)
    RCC->APBENR1 |= RCC_APBENR1_USBEN;
    RCC->APBRSTR1 |= RCC_APBRSTR1_USBRST;
    RCC->APBRSTR1 &= ~RCC_APBRSTR1_USBRST;
#endif

#if defined(STM32G4) || defined(STM32G4xx)
    RCC->APB1ENR1 |= RCC_APB1ENR1_USBEN;
    RCC->APB1RSTR1 |= RCC_APB1RSTR1_USBRST;
    RCC->APB1RSTR1 &= ~RCC_APB1RSTR1_USBRST;
#endif

