rafaelmartins/usbd-fs-stm32/src/usbd.c
    USB->CNTR &= ~USB_CNTR_PDWN;

    pma_init();

    USB->ISTR = 0;
    USB->CNTR = USB_CNTR_CTRM | USB_CNTR_WKUPM | USB_CNTR_SUSPM | USB_CNTR_RESETM;
    if (usbd_in_cb || usbd_sof_cb)
        USB->CNTR |= USB_CNTR_SOFM;
    USB->BCDR = USB_BCDR_DPPU;
}


void
usbd_task(void)
{
    uint16_t istr = USB->ISTR & (USB_ISTR_CTR | USB_ISTR_WKUP | USB_ISTR_SUSP | USB_ISTR_RESET | USB_ISTR_SOF);
    if (istr == 0)
        return;

    if ((istr & USB_ISTR_WKUP) == USB_ISTR_WKUP) {
        USB->ISTR &= ~(USB_ISTR_SUSP | USB_ISTR_WKUP);
        USB->CNTR &= ~USB_CNTR_FSUSP;
        if (usbd_resume_hook_cb)
            usbd_resume_hook_cb();
        return;
    }

    if ((istr & USB_ISTR_SUSP) == USB_ISTR_SUSP) {
        USB->ISTR &= ~USB_ISTR_SUSP;
        USB->CNTR |= USB_CNTR_FSUSP;
        if (usbd_suspend_hook_cb)
            usbd_suspend_hook_cb();
        return;
    }

    if ((istr & USB_ISTR_RESET) == USB_ISTR_RESET) {
        USB->ISTR &= ~USB_ISTR_RESET;

        if (usbd_reset_hook_cb)
            usbd_reset_hook_cb(true);

        for (uint8_t i = 0; i < 8; i++)
            *(endpoints[i].reg) &= ~USB_EPREG_MASK;

        state = STATE_DEFAULT;
        address = 0;
        USB->DADDR = USB_DADDR_EF | address;

        USB->EP0R |= endpoints[0].type;
        USB->EP0R = (USB->EP0R ^ (USB_EP_RX_VALID | USB_EP_TX_NAK)) &
            (USB_EPREG_MASK | USB_EPRX_STAT | USB_EP_DTOG_RX | USB_EP_DTOG_TX);

        if (usbd_reset_hook_cb)
            usbd_reset_hook_cb(false);
        return;
    }

    if ((istr & USB_ISTR_CTR) == USB_ISTR_CTR) {
        uint8_t ep = USB->ISTR & USB_ISTR_EP_ID;

        if (ep == 0) {
            if (USB->EP0R & (USB_EP_CTR_RX|USB_EP_SETUP)) {
                USB->EP0R &= USB_EPREG_MASK ^ USB_EP_CTR_RX;

                usb_ctrl_request_t req;
                uint16_t len = usbd_out(0, &req, sizeof(usb_ctrl_request_t), true);
                if ((len == sizeof(usb_ctrl_request_t)) && handle_ctrl_setup(&req)) {
                    if ((req.bmRequestType & USB_REQ_DIR_MASK) == USB_REQ_DIR_HOST_TO_DEVICE)
                        usbd_control_in(NULL, 0, req.wLength);
                    return;
                }

                USB->EP0R = (USB->EP0R ^ USB_EP_TX_STALL) & (USB_EPREG_MASK | USB_EPTX_STAT);
                USB->EP0R = (USB->EP0R ^ USB_EP_RX_STALL) & (USB_EPREG_MASK | USB_EPRX_STAT);
                return;
            }

            if (USB->EP0R & USB_EP_CTR_TX) {
                USB->EP0R &= USB_EPREG_MASK ^ USB_EP_CTR_TX;

                if (set_address) {
                    USB->DADDR = USB_DADDR_EF | address;
                    set_address = false;
                    state = STATE_ADDRESS;
                }

                if (usbd_control_in_resume())
                    return;
            }
        }

        if ((*(endpoints[ep].reg) & USB_EP_CTR_RX) == USB_EP_CTR_RX) {
            *(endpoints[ep].reg) &= USB_EPREG_MASK ^ USB_EP_CTR_RX;
            if (usbd_out_cb)
                usbd_out_cb(ep);
        }
        if ((*(endpoints[ep].reg) & USB_EP_CTR_TX) == USB_EP_CTR_TX) {
            *(endpoints[ep].reg) &= USB_EPREG_MASK ^ USB_EP_CTR_TX;
            if (usbd_in_cb &&
                (((*endpoints[ep].reg) & (USB_EPTX_STAT | USB_EPADDR_FIELD)) == (USB_EP_TX_NAK | ep)))
                usbd_in_cb(ep);
        }
    }

    if ((istr & USB_ISTR_SOF) != USB_ISTR_SOF)
        return;
    USB->ISTR &= ~USB_ISTR_SOF;

    if (usbd_sof_cb)
        usbd_sof_cb();

    if (!usbd_in_cb)
        return;

#if USBD_EP1_IN_SIZE > 0
    if ((USB->EP1R & (USB_EPTX_STAT | USB_EPADDR_FIELD)) == (USB_EP_TX_NAK | 1))
        usbd_in_cb(1);
#endif
#if USBD_EP2_IN_SIZE > 0
    if ((USB->EP2R & (USB_EPTX_STAT | USB_EPADDR_FIELD)) == (USB_EP_TX_NAK | 2))
        usbd_in_cb(2);
#endif
#if USBD_EP3_IN_SIZE > 0
    if ((USB->EP3R & (USB_EPTX_STAT | USB_EPADDR_FIELD)) == (USB_EP_TX_NAK | 3))
        usbd_in_cb(3);
#endif
#if USBD_EP4_IN_SIZE > 0
    if ((USB->EP4R & (USB_EPTX_STAT | USB_EPADDR_FIELD)) == (USB_EP_TX_NAK | 4))
        usbd_in_cb(4);
#endif
#if USBD_EP5_IN_SIZE > 0
    if ((USB->EP5R & (USB_EPTX_STAT | USB_EPADDR_FIELD)) == (USB_EP_TX_NAK | 5))
        usbd_in_cb(5);
#endif
#if USBD_EP6_IN_SIZE > 0
    if ((USB->EP6R & (USB_EPTX_STAT | USB_EPADDR_FIELD)) == (USB_EP_TX_NAK | 6))
        usbd_in_cb(6);
#endif
#if USBD_EP7_IN_SIZE > 0
    if ((USB->EP7R & (USB_EPTX_STAT | USB_EPADDR_FIELD)) == (USB_EP_TX_NAK | 7))
        usbd_in_cb(7);
#endif
}


static inline uint8_t
to_hex(uint8_t v)
{
    if ((v & 0xf) > 9)
        return (v & 0xf) - 10 + 'A';
    return (v & 0xf) + '0';
}

const usb_string_descriptor_t*
usbd_serial_internal_string_descriptor(void)
{
    static struct {
        uint8_t bLength;
        uint8_t bDescriptorType;
        uint16_t wData[0x18];
    } __ALIGNED(2) descr = {
        .bLength = 0,
        .bDescriptorType = USB_DESCR_TYPE_STRING,
    };

    if (descr.bLength > 0)
        return (const usb_string_descriptor_t*) &descr;

    uint8_t idx = 0;
    for (uint8_t i = 0; i < 12; i++) {
        uint8_t tmp = *((uint8_t*) (UID_BASE + i));
        descr.wData[idx++] = to_hex(tmp >> 4);
        descr.wData[idx++] = to_hex(tmp);
    }

    descr.bLength = sizeof(descr.bLength) + sizeof(descr.bDescriptorType) +
        idx * sizeof(uint16_t);

    return (const usb_string_descriptor_t*) &descr;
}
